Repository: macko99/sara-ios-public
Catalog: lifeSavingApp/*.lproj/Localizable.strings
Languages: pl

# Loding...
source: Loading...
pl: Pracuję...

source: Loaded
pl: Gotowe

# Faild
source: Failed
pl: Niepowodzenie

source: Idle
pl: Bezczynny

source: No media content
pl: Brak zawartości

source: Not loaded yet
pl: Nie pobrany

source: Loaded from server
pl: Pobrany z serwera

source: Image saved locally
pl: Obraz zapisany w urządzeniu

source: Session expired!
pl: Sejsa wygasła!

source: You have been logout. Should it be a bug, please contact administration.
pl: Zostałeś wylogowany. Jeżeli błędznie to zgłoś to do administratora.

source: Log In to your account
pl: Logowanie

source: Use SSL
pl: Używaj SSL

source: Username
pl: Nazwa użytkownika

source: Pasword
pl: Hasło

source: Code
pl: Kod

source: Log In
pl: Zaloguj się

source: Login failed!
pl: Logowanie nie powiodło się

source: Please check entered credentials.
pl: Sprawdź podane dane

source: Got it!
pl: Rozumiem!

source: Server address validation failed!
pl: Podany błędny adres serwera!

# Please check entered addres/ip address or port number and try again.
source: Please check entered address/ip address or port number and try again.
pl: Prosze sprawdzić wpisany adres URL lub IP oraz numer portu i spróbować ponownie.

source: Got one time passcode?
pl: Masz jednorazowy kod?

# Back to username and pasword?
source: Back to username and password?
pl: Znasz nazwę użytkownika i hasło?

source: Click Here
pl: Kliknij tutaj

source: Home
pl: Witaj

source: Map
pl: Mapa

source: Actions
pl: Akcje

source: Profile
pl: Profil

source: Set your password!
pl: Ważne, ustaw swoje hasło!

source: Please go to Profile tab and set your password by clicking Change password. Otherwise you may be not able to log in again.
pl: Przejdź to zakładki Profil i ustaw hasło dla swojego konta klikając Zmień hasło. Inaczej możesz nie móc się ponownie zalogować.

source: Chat (beta)
pl: Czat (beta)

source: Welcome
pl: Witaj

source: Location is needed
pl: Lokalizacja jest wymagana

# Go to Settigns
source: Go to Settings
pl: Przejdź do ustawień

source: Dismiss
pl: Odrzuć

source: Quick guide:
pl: Instrukcja:

# AllowAlwaysLocation
source: To provide full functionality this aplication needs to access your location even in backgroud. Please go to Setting and allow Location **Always**.
pl: Aby aplikacja mogła działać poprawnie, niezbędne jest korzystanie z lokalizacji w tle. Przejdź do ustawień telefonu i pozwól na udostępnianie lokalizacji **Zawsze**

# WelcomeMessage
source: Welcome, this application was created to support ***Search and rescue*** activities.
pl: Witaj w aplikacji wspomagającej działania ***Search and Rescue.***

# ModuleOverView
source: App consists of 3 main views: ***Map***, ***Actions*** and ***Profile***, you can use bar on the bottom of the screen to navigate between them.
pl: Aplikacja posiada 3 główne widoki: ***Mapa***, ***Akcje*** oraz ***Profil***. Możesz się pomiędzy nimi przemieszczać używając paska na dole ekranu.

# ProfileOverView
source: On ***Profile*** tab you can review details of your account and change some of them if desired. In addiction you will find details regarding pushing your ***GPS*** data to server there, some of them are adjustable (more about it below).
pl: W zakładce ***Profil*** zobaczysz szczegóły swojego konta i w razie potrzeby zmienisz dane swojego użytkownika. Znajdziesz tu również szczegóły wysyłania danych na serwer - niektóre z nich będziesz mógł zmienić (zostały one omówione poniżej).

# ActionsOverView
source: ***Actions*** tab provides you with updated list of actions, that you have been added to. Each action is presented with overview data such as: action name, description, start time and information about actual action status. After navigating into action details, you are given possibility to join action or leave the current one.
pl: W zakładce ***Akcje*** znajdziesz listę Akcji, do których zostałeś dodany. Widok ten prezentuje podstawowe dane, takie jak: nazwa, opis, data rozpoczęcia oraz informację czy określona Akcja jest obecnie aktywna. Klikając w wybraną Akcję poznasz jej szczegóły oraz będziesz mógł do niej dołączyć lub ją opuścić.

# DataOverView
source: You will start sharing your device's location data (**GPS**) when you choose to join one of available actions. Data will be pushed according to time interval set by action organiser (you can see current value on **Profile** tab). Shared data include **width of observation** too, it means the area you can effectively search while participating in action. This value can be found and modified in **Profile** view, also there you can choose to disable location data sharing while still taking part in action.
pl: Dołączając do Akcji rozpoczynasz wysyłanie danych lokalizacyjnych z urządzenia (***GPS***) na serwer. Dzieje się to z interwałem ustawionym indywidualnie przez administratora Akcji (wartość widoczna w zakładce ***Profil***). Wysyłane dane uwzględniają również szerokość obserwacji (obszar efektywnie przeszukiwany). W zakładce ***Profil*** możesz ją samodzielnie edytować, a także wyłączyć opcję wysyłania danych ***GPS***, bez rezygnacji z uczestnictwa w Akcji.

# MapOverView
source: When you choose to join one of the actions ***Map*** tab provides you with all the most crucial data regarding course of action. Using the 3 buttons on the right side of the screen you can localize yourself on the map, set map to show the whole action region and add new **special point** to current action. **Points** are the characteristic places that have drawn your attention and you want to share this with other participants. While creating new point you can give it a name, longer description and **attach an image** from your device gallery. Map view is also equipped with bottom slide over card where it is easy to change displayed map style and choose whether to display map annotations. There are **4 kinds of annotations**: areas assigned to you, other areas in action scope, path you have followed (available when sharing GPS data is enabled) and special points added by all participants.
pl: Po dołączeniu do wybranej Akcji, w zakładce ***Mapy*** znajdziesz najbardziej istotne informacje. Korzystając z 3 przycisków z prawej strony ekranu możesz zlokalizować się na mapie, wycentrować widok na ustalony obszar aktualnej Akcji oraz ***dodać punkt do mapy***. Punkty to specjalne miejsca, które mają zwrócić uwagę wszystkich uczestników Akcji. Do każdego punktu, oprócz informacji tekstowej, ***można dołączyć zdjęcie*** wybrane z galerii. Widok mapy posiada kartę wysuwaną z dolnej części ekranu, na której możesz wybrać typ wyświetlanej mapy oraz dodatkowe oznaczenia. ***Są 4 rodzaje oznaczeń:*** obszary przydzielone Ci przez organizatora Akcji, obszary innych uczestników, ścieżka którą pokonałeś (dostępna przy włączonym wysyłaniu danych GPS) oraz wspomniane wcześniej punkty specjalne dodawane przez uczestników Akcji.

# DataOverViewDetails
source: Application has been prepared to work in environment with bad network availability, therefore even when you are offline your GPS data and created points would not disappear. All of the collected and created data will be automatically uploaded when internet service is available again.
pl: Aplikacja została przystosowana do pracy w środowisku bez stabilnego połączenia z internetem, dlatego nawet gdy jesteś poza siecią Twoje dane z GPS oraz punkty, które dodasz do mapy nie przepadną. Zostaną one automatycznie wysłane, kiedy tylko połączenie z serwerem będzie możliwe.

# PushOverView
source: App is also capable of receiving **push notifications**, even when it was not opened, so please bear in mind to allow getting notifications. You will be notified about creation of a new action with your participation, changing status of one your actions, assigning a new area to you or about new special point added to current action.
pl: Aplikacja wspiera także ***powiadomienia push***, nawet gdy jest wyłączona, więc nie musisz się martwić, że coś przeoczysz. Zostaniesz poinformowany o pojawieniu się nowej Akcji z Twoim udziałem, aktywowaniu jednej z nich, dodaniu obszaru przeznaczonego dla Ciebie lub o nowym punkcie specjalnym w ramach Akcji, w której uczestniczysz.

# OtherOverView
source: Light and dark mode are supported. Additionally, please make sure to set access to your phone's location service to **Always**, it is mandatory for this application to work properly.
pl: Wspierany jest zarówno ciemny jak i jasny wygląd interfejsu. Ważne jest, abyś zezwolił aplikacji na korzystanie z lokalizacji ***Zawsze*** oraz zgodził się na wysyłanie powiadomień.

# AllowAlwaysLocation-ios14
source: To provide full functionality this aplication needs to access your location even in backgroud. Please go to Setting and allow Location Always.
pl: Aby aplikacja mogła działać poprawnie, niezbędne jest korzystanie z lokalizacji w tle. Przejdź do ustawień telefonu i pozwól na udostępnianie lokalizacji Zawsze

# WelcomeMessage-ios14
source: Welcome, this application was created to support Search and Rescue activities.
pl: Witaj w aplikacji wspomagającej działania Search and Rescue.

# ModuleOverView-ios14
source: App consists of 3 main views: Map, Actions and Profile, you can use bar on the bottom of the screen to navigate between them.
pl: Aplikacja posiada 3 główne widoki: Mapa, Akcje oraz Profil. Możesz się pomiędzy nimi przemieszczać używając paska na dole ekranu.

# ProfileOverView-ios14
source: On Profile tab you can review details of your account and change some of them if desired. In addiction you will find details regarding pushing your GPS data to server there, some of them are adjustable (more about it below).
pl: W zakładce Profil zobaczysz szczegóły swojego konta i w razie potrzeby zmienisz dane swojego użytkownika. Znajdziesz tu również szczegóły wysyłania danych na serwer - niektóre z nich będziesz mógł zmienić (zostały one omówione poniżej).

# ActionsOverView-ios14
source: Actions tab provides you with updated list of actions, that you have been added to. Each action is presented with overview data such as: action name, description, start time and information about actual action status. After navigating into action details, you are given possibility to join action or leave the current one.
pl: W zakładce Akcje znajdziesz listę akcji, do których zostałeś dodany. Widok ten prezentuje podstawowe dane, takie jak: nazwa, opis, data rozpoczęcia oraz informację czy określona Akcja jest obecnie aktywna. Klikając w wybraną Akcję poznasz jej szczegóły oraz będziesz mógł do niej dołączyć lub ją opuścić.

# DataOverView-ios14
source: You will start sharing your device's location data (GPS) when you choose to join one of available actions. Data will be pushed according to time interval set by action organiser (you can see current value on Profile tab). Shared data include width of observation too, it means the area you can effectively search while participating in action. This value can be found and modified in Profile view. There you can also choose to disable location data sharing while still taking part in action.
pl: Dołączając do Akcji rozpoczynasz wysyłanie danych lokalizacyjnych z urządzenia (GPS) na serwer. Dzieje się to z interwałem ustawionym indywidualnie przez administratora Akcji (wartość widoczna w zakładce Profil). Wysyłane dane uwzględniają również szerokość obserwacji (obszar efektywnie przeszukiwany). W zakładce Profil możesz ją samodzielnie edytować, a także wyłączyć opcję wysyłania danych GPS, bez rezygnacji z uczestnictwa w Akcji.

# MapOverView-ios14
source: When you choose to join one of the actions Map tab provides you with all the most crucial data regarding course of action. Using the 3 buttons on the right side of the screen you can: localize yourself on the map, set map to show the whole action region or add new special point to current action. Points are the characteristic places that have drawn your attention. You may share them with other participants. While creating new point you can give it a name, longer description and attach an image from your device gallery. Map view is also equipped with bottom slide over card where it is easy to change displayed map style and choose whether to display map annotations. There are 4 kinds of annotations: areas assigned to you, other areas in action scope, path you have followed (available when sharing GPS data is enabled) and special points added by all participants.
pl: Po dołączeniu do wybranej Akcji, w zakładce Mapy znajdziesz najbardziej istotne informacje. Korzystając z 3 przycisków z prawej strony ekranu można zlokalizować się na mapie, wycentrować widok na ustalony obszar aktualnej Akcji oraz dodać punkt do mapy. Punkty to specjalne miejsca, które mają zwrócić uwagę wszystkich uczestników Akcji. Do każdego punktu, oprócz informacji tekstowej, można dołączyć zdjęcie wybrane z galerii. Widok mapy posiada kartę wysuwaną z dolnej części ekranu, na której możesz wybrać typ wyświetlanej mapy oraz dodatkowe oznaczenia. Są 4 rodzaje oznaczeń: obszary przydzielone Ci przez organizatora Akcji, obszary innych uczestników, ścieżka którą pokonałeś (dostępna przy włączonym wysyłaniu danych GPS) oraz wspomniane wcześniej punkty specjalne dodawane przez uczestników akcji.

# DataOverViewDetails-ios14
source: Application has been prepared to work in environment with bad network availability, therefore even when you are offline your GPS data and created points would not disappear. All of the collected and created data will be automatically uploaded when internet service is available again.
pl: Aplikacja została przystosowana do pracy w środowisku bez stabilnego połączenia z internetem, dlatego nawet gdy jesteś poza siecią twoje dane z GPS oraz punkty, które dodasz do mapy nie przepadną. Zostaną one automatycznie wysłane, kiedy tylko połączenie z serwerem będzie możliwe.

# PushOverView-ios14
source: App is also capable of receiving push notifications, even when it was not opened, so please bear in mind to allow getting notifications. You will be notified about creation of a new action with your participation, changing status of one your actions, assigning a new area to you or about new special point added to current action.
pl: Aplikacja wspiera także powiadomienia push, nawet gdy jest wyłączona więc nie musisz się martwić, że coś przeoczysz. Zostaniesz poinformowany o pojawieniu się nowej akcji z Twoim udziałem, aktywowaniu jednej z nich, dodaniu obszaru przeznaczonego dla Ciebie lub o nowym punkcie specjalnym w ramach Akcji, w której uczestniczysz.

# OtherOverView-ios14
source: Light and dark mode are supported. Additionally, please make sure to set access to your phone's location service to Always, it is mandatory for this application to work properly.
pl: Wspierany jest zarówno ciemny jak i jasny wygląd interfejsu. Ważne jest, abyś zezwolił aplikacji na korzystanie z lokalizacji Zawsze oraz zgodził się na wysyłanie powiadomień.

source: Action is not set. To take full advantage of map view please join one of available actions first.
pl: Aby korzystać z funckji mapy musisz najpierw dołączyć do jednej z dostepnych akcji.

source: Standard
pl: Standardowa

source: Satellite
pl: Satelitarna

source: Hybrid
pl: Hybrydowa

source: Show my areas
pl: Pokaż moje obszary

source: Show other areas
pl: Pokaż obszary innych

source: Show my routes
pl: Pokaż przebyte ścieżki

source: Show special points
pl: Pokaż punkty specjalne

source: Pick layers
pl: Wybierz warstwy

source: Path start:
pl: Początek:

source: Area
pl: Obszar

source: Show areas names
pl: Pokaż nazwy obszarów

source: Current
pl: Aktualna

source: Active
pl: Aktywna

source: Inactive
pl: Nieaktywna

source: Actions list
pl: Lista akcji

source: Are you sure?
pl: Jesteś pewien?

source: If you join this action, you will leave current one. You can participate in one action at the time. Additionally you will start sharing your GPS data.
pl: Jeżeli dołączysz do tej akcji, przestaniesz brać udział w dotychczasowej! Możesz brać udział tylko w jednej akcji równocześnie. Twoje dane GPS zaczną być udostępniane.

source: If you leave action its data saved in device memory will be removed. If you do not have Internet connection at the moment it could be not possible to regain access to those data until returning online. Do you still want to leave?
pl: Jeżeli opuścisz teraz akcję jej dane zostaną usunięte z tego telefonu. Jeżeli nie masz połączenia z internetem, chwilowo może nie być możliwe ponownego uzyskanie tych danych.

source: If you join this action you will start sharing your GPS data.
pl: Jeżeli dołączysz do akcji twoje dane GPS zaczną być udostępniane.

source: Hello
pl: Cześć

source: please refresh
pl: Proszę odświeżyć

source: Username:
pl: Nazwa użytkownika:

source: Phone number:
pl: Numer telefonu:

source: Collecting location data
pl: Udostępnianie danych GPS

source: To collect data please join action first.
pl: Dołącz do akcji aby udostępniać dane.

source: GPS data upload interval:
pl: Interwał wysyłania danych GPS:

source: Last successful upload:
pl: Ostatnie powodzenie udostępniania:

source: none
pl: brak

source: Width of observation:
pl: Szerokość obserwacji:

source: Width of observation
pl: Szerokość obserwacji

# Chnage password
source: Change password
pl: Zmień hasło

source: Log Out
pl: Wyloguj się

# Chnage first or last name
source: Change first or last name
pl: Zmień imię lub nazwisko

source: Action details
pl: Szczegoły akcji

source: Start time:
pl: Czas rozpoczęcia:

source: Is active now:
pl: Jest już aktywna:

source: Yes
pl: Tak

source: No
pl: Nie

source: Action:
pl: Akcja:

source: Navigate to action using maps
pl: Nawiguj do akcji używając map

source: Leave current action
pl: Opuść akcję

source: Join
pl: Dołącz!

source: No name provided
pl: Brak nazwy

source: Empty
pl: Pusty

source: Point
pl: Punkt

source: Get directions
pl: Nawiguj

source: User:
pl: Użytkownik:

source: Unknown
pl: Nieznany

source: Media content
pl: Załącznik

source: Please try again
pl: Proszę spróbować ponownie

source: Point details
pl: Szczegóły punktu

source: Close
pl: Zamknij

source: Time:
pl: Czas:

source: Location:
pl: Miejsce:

source: Name:
pl: Nazwa:

source: Description:
pl: Opis:

source: Media content:
pl: Załącznik:

source: You can attach an image to this point below.
pl: Dołącz zdjęcie poniżej.

source: Change selection
pl: Zmień wybów

source: Remove selection
pl: Usuń wybór

source: Tap to select a picture
pl: Kliknij aby wybrać zdjęcie

source: Add point
pl: Dodaj!

source: Create new point
pl: Utwórz nowy punkt

source: Cancel
pl: Anuluj

source: Please confirm
pl: Potwierdź

source: Do you want to cancel?
pl: Chcesz anulować?

source: Success
pl: Udało się!

source: Data was successfully uploaded!
pl: Dane wysłane z powodzeniem.

source: Network failed
pl: Błąd połączenia

# Do not worry, we will try again later automatiacally.
source: Do not worry, we will try again later automatically.
pl: Nie martw się, spróbujemy automatycznie wysłać dane ponownie.

source: Something went wrong
pl: Coś poszło nie tak...

source: Sorry, something went wrong... Try again later
pl: Przepraszamy, coś poszło nie tak... Spróbuj później

# Chnage your username
source: Change your username
pl: Zmień swoją nazwę użytkownika

source: New username
pl: Nowa nazwa

source: Request failed!
pl: Niepowodzenie

source: Username is already taken!
pl: Użytkownik o takiej nazwie już istnieje!

source: Username field empty!
pl: Nazwa użytkownika nie może być pusta.

source: Please enter new username if you want to change current one.
pl: Podaj nową nazwę użytkonika.

source: Please try again later.
pl: Spróbuj ponownie później.

source: Username updated!
pl: Nazwa użytkownika zmieniona!

# Chnage your password
source: Change your password
pl: Zmień swoje hasło

source: New password
pl: Nowe hasło

source: Exceeded character limit.
pl: Przekroczono limit znaków.

source: Change!
pl: Zmień!

# Passwod field empty!
source: Password field empty!
pl: Nowe hasło nie może być puste.

source: Please enter new password if you want to change current one.
pl: Podaj nowe hasło.

source: Password updated!
pl: Hasło zaktualizowane!

source: You can go back to using the app.
pl: Możesz wrócić do aplikacji.

source: Try joining chat room
pl: Spróbuj dołączyć do czatu

# WelcomeChat
source: Welcome to Chat ***beta***!
pl: Witaj na Czacie ***beta***!

# WelcomeChatMainTab
source: Chat ***beta*** is available! Chat is only available to selcted users on selected actions. Please join action to use it. Chat is only available online, no messages are being kept offline on device. You can see up to 100 recent messages. It is not direct, it works as a chat room for everyone on selected action.
pl: Czat ***beta*** już dostępny! Czat jest dostępny tylko dla wybranych użytkowników, podczas wybranych akcji. Aby z niego korzystać dołącz do jednej z nich. Co ważne czat jest dostępny tylko online w formie czat-pokoju dla wybranej akcji i żadne dane nie są przechowywane w urządzeniu poza siecią. Na Czacie możesz wyświetlić do 100 ostatnich wiadomości.

# WelcomeChat-ios14
source: Welcome to Chat beta!
pl: Witaj na Czacie beta!

# WelcomeChatMainTab-ios14
source: Chat beta is available! Chat is only available to selcted users on selected actions. Please join action to use it. Chat is only available online, no messages are being kept offline on device. You can see up to 100 recent messages. It is not direct, it works as a chat room for everyone on selected action.
pl: Czat beta już dostępny! Czat jest dostępny tylko dla wybranych użytkowników, podczas wybranych akcji. Aby z niego korzystać dołącz do jednej z nich. Co ważne czat jest dostępny tylko online w formie czat-pokoju dla wybranej akcji i żadne dane nie są przechowywane w urządzeniu poza siecią. Na Czacie możesz wyświetlić do 100 ostatnich wiadomości.

source: Join action first.
pl: Aby rozpocząć dołącz do akcji.

source: New message
pl: Nowa wiadomość

source: Quit
pl: Zakończ

source: Chat
pl: Czat

source: shutdown
pl: wyłączono

source: Not active
pl: Nie aktywny

source: Authorized
pl: Pomyślna autoryzacja

source: Failed.
pl: Błąd.

source: Loading
pl: Ładowanie

source: Not available
pl: Czat niedostępny.

# Chnage your information
source: Change your information
pl: Zmień swoje dane

source: First name
pl: Imię

source: Last name
pl: Nazwisko

source: No change has been done to current values.
pl: Nie wprowadzono żadnych zmian.

source: If you wish please enter new values.
pl: W razie chęci podaj nowe wartości.

source: Values updated!
pl: Informacje zaktualizowane!
